src/cf/ChartsOfCharacteristicTypes/CRM_Классификаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CRM_Классификаторы</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
				<v8:Type>cfg:CatalogRef.вогДизайныНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогНоменклатурныеПозиции</v8:Type>
				<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.вогТорговоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
				<v8:Type>cfg:CatalogRef.вогКоллекцииНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогКоммерческиеСоглашения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
				<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
				<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтображения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыОтображенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемаяАналитика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_АналитикаКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеФорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеВыводитьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораЗависимости</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленаЗависимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтальноеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеМожноОтметитьНаКарте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВФормеСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКакПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПриИзменении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикНачалоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/CRM_Классификаторы/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;	
	
	Если Параметры.Свойство("Принадлежность") Тогда
		Если ТипЗнч(Параметры.Принадлежность.ИмяТаблиц) = Тип("Строка") Тогда
			СписокИменТаблиц = Новый СписокЗначений;
			СписокИменТаблиц.Добавить(Параметры.Принадлежность.ИмяТаблиц);
			
		Иначе
			СписокИменТаблиц = Параметры.Принадлежность.ИмяТаблиц;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Ссылка.Принадлежность.ИмяТаблицы", 
			СписокИменТаблиц,
			ВидСравненияКомпоновкиДанных.ВСписке
		);
		
	КонецЕсли;
	
	// ++ Харченко Д.И. №  - 06.09.2018 / 
	
	Если Параметры.Свойство("ВидОтображенияИсключить") Тогда
		
		Если ТипЗнч(Параметры.ВидОтображенияИсключить) = Тип("ПеречислениеСсылка.CRM_ВидыОтображенияКлассификаторов") Тогда
			
			СписокВидОтображенияИсключить = Новый СписокЗначений;
			СписокВидОтображенияИсключить.Добавить(Параметры.ВидОтображенияИсключить);
			
		Иначе
			
			СписокВидОтображенияИсключить = Параметры.ВидОтображенияИсключить;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОтображения", СписокВидОтображенияИсключить, ВидСравненияКомпоновкиДанных.НеВСписке);

	КонецЕсли;
	
	// -- Харченко Д.И. №  - 06.09.2018
КонецПроцедуры

#КонецОбласти
